In [1]:
%load_ext sql

In [2]:
%sql postgresql://student:student@127.0.0.1/immigrationsdb

'Connected: student@immigrationsdb'

In [3]:
%%sql 
SELECT * 
FROM immigrations 
LIMIT 5;

 * postgresql://student:***@127.0.0.1/immigrationsdb
5 rows affected.

[(6.0, 692.0, 692.0, 'XXX', 'NaN', None, datetime.date(2016, 4, 29), 9.0, None),
 (7.0, 254.0, 276.0, 'ATL', 'Atlanta', 'AL', datetime.date(2016, 4, 7), 1.0, None),
 (15.0, 101.0, 101.0, 'WAS', 'Washington', 'MI', datetime.date(2016, 4, 1), 1.0, 'OS'),
 (16.0, 101.0, 101.0, 'NYC', 'New York', 'MA', datetime.date(2016, 4, 1), 1.0, 'AA'),
 (17.0, 101.0, 101.0, 'NYC', 'New York', 'MA', datetime.date(2016, 4, 1), 1.0, 'AA')]

In [4]:
%sql SELECT * FROM race LIMIT 5;

 * postgresql://student:***@127.0.0.1/immigrationsdb
5 rows affected.

[('Alabama', 'AL', 8084.0, 28769.0, 521068.0, 39313.0, 498920.0),
 ('Alaska', 'AK', 36339.0, 36825.0, 23107.0, 27261.0, 212696.0),
 ('Arizona', 'AZ', 129708.0, 229183.0, 296222.0, 1508157.0, 3591611.0),
 ('Arkansas', 'AR', 9381.0, 22062.0, 149608.0, 77813.0, 384733.0),
 ('California', 'CA', 401386.0, 4543730.0, 2047009.0, 9856464.0, 14905129.0)]

In [5]:
%sql SELECT * FROM airlines LIMIT 5;

 * postgresql://student:***@127.0.0.1/immigrationsdb
5 rows affected.

[('1T', 3, '1Time Airline', 'South Africa', 'Y'),
 ('Q5', 10, '40-Mile Air', 'United States', 'Y'),
 ('AN', 13, 'Ansett Australia', 'Australia', 'Y'),
 ('1B', 14, 'Abacus International', 'Singapore', 'Y'),
 ('ZI', 21, 'Aigle Azur', 'France', 'Y')]

In [6]:
%sql SELECT * FROM demographics LIMIT 5;

 * postgresql://student:***@127.0.0.1/immigrationsdb
5 rows affected.

[(2727, 'Abilene', 'Texas', 31.3, 65212.0, 60664.0, 125876.0, 9367.0, 8129.0, 2.64, 'TX'),
 (2175, 'Akron', 'Ohio', 38.1, 96886.0, 100667.0, 197553.0, 12878.0, 10024.0, 2.24, 'OH'),
 (1868, 'Alafaya', 'Florida', 33.5, 39504.0, 45760.0, 85264.0, 4176.0, 15842.0, 2.94, 'FL'),
 (1294, 'Alameda', 'California', 41.4, 37747.0, 40867.0, 78614.0, 4504.0, 18841.0, 2.52, 'CA'),
 (2278, 'Albany', 'New York', 32.8, 47627.0, 50825.0, 98452.0, 3643.0, 11948.0, 2.08, 'NY')]

In [7]:
%sql SELECT * FROM temperature ORDER by dt DESC LIMIT 5;

 * postgresql://student:***@127.0.0.1/immigrationsdb
5 rows affected.

[(datetime.date(2013, 9, 1), 'Yonkers', 17.408, 1.048),
 (datetime.date(2013, 9, 1), 'Worcester', 15.883, 1.368),
 (datetime.date(2013, 9, 1), 'Winston Salem', 21.692, 0.913),
 (datetime.date(2013, 9, 1), 'Windsor', 17.503, 1.13),
 (datetime.date(2013, 9, 1), 'Wichita Falls', 26.466, 1.264)]

# Analysing Data to Answer questions

#### TOP FIVE Airlines with flights landed in Chicago on April 10th, 2016

In [20]:


%%sql

SELECT COUNT(pa.name), 
    pa.name 
FROM (
    SELECT a.name 
    FROM immigrations i 
    JOIN airlines a 
    ON i.airline = a.iata  
    WHERE i.arrdate = '2016-04-10' AND i.city ='Chicago' 
    ) as pa 

GROUP BY 2 

ORDER BY 1 DESC 
LIMIT 5;

 * postgresql://student:***@127.0.0.1/immigrationsdb
5 rows affected.

[(1164, 'United Airlines'),
 (592, 'American Airlines'),
 (319, 'British Airways'),
 (300, 'Scandinavian Airlines System'),
 (275, 'All Nippon Airways')]

#### Caculating the percentage of Asian Community of the most visited U.S. state by Indian Citizens Country - `Code:'213'`

In [21]:

%%sql

SELECT d.state, 
    r.asian, 
    SUM(d.total_population) as total_pop, 
    r.asian / SUM(d.total_population)*100 as asian_pct 
    
FROM (
    SELECT i94addr state_code, 
    COUNT(i94cit) as visits 
    FROM immigrations 
    WHERE i94cit = '213' 
    GROUP BY 1 
    ORDER BY 2 DESC 
    LIMIT 1
    ) as mvs 

JOIN race r 

ON r.state_code = mvs.state_code 

JOIN demographics d 

ON d.state_code = r.state_code 

GROUP BY 1,2 

ORDER BY 4 DESC;

 * postgresql://student:***@127.0.0.1/immigrationsdb
1 rows affected.

[('California', 4543730.0, 24822460.0, 18.3049141785303)]